{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "64"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/net/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "4"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "4"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/net/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/net/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "64"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/net/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/net/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/net/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/net/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/net/Relu"], "attr": {"ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/net/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/net/MaxPool2d", "StatefulPartitionedCall/net/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/net/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/net/MaxPool2d_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/net/Relu_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/Relu_2", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/net/MaxPool2d_1", "StatefulPartitionedCall/net/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/net/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/net/MaxPool2d_2", "op": "MaxPool", "input": ["StatefulPartitionedCall/net/Relu_2"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/net/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/net/MaxPool2d_2", "StatefulPartitionedCall/net/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/net/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/net/flatten/Reshape", "StatefulPartitionedCall/net/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/net/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/net/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/net/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/net/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/net/conv2d/Conv2D/ReadVariableOp", "shape": [4, 4, 1, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/net/conv2d/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/net/conv2d_1/Conv2D/ReadVariableOp", "shape": [4, 4, 4, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/net/conv2d_1/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/net/conv2d_2/Conv2D/ReadVariableOp", "shape": [4, 4, 4, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/net/conv2d_2/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/net/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/net/dense/MatMul/ReadVariableOp", "shape": [128, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/net/dense/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}